donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/application.c
/*
 * File      : application.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2006, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-01-05     Bernard      the first version
 */

/**
 * @addtogroup STM32
 */
/*@{*/
#include <rtdef.h>
#include <board.h>
#include <rtthread.h>
#include <finsh.h>
#include <syscfgdata.h>


#if RT_USING_FILESYSTEM
/* dfs init */
#include <dfs_init.h>
/* dfs filesystem:ELM filesystem init */
#include <dfs_elm.h>
/* dfs Filesystem APIs */
#include <dfs_fs.h>
#endif

#if RT_USING_TCPIP_STACK
#include <lwip/sys.h>
#include <lwip/api.h>
#endif

#if RT_USING_GUI
#include <rtgui/rtgui.h>
#include <rtgui/rtgui_server.h>
#include <rtgui/rtgui_system.h>
#include <rtgui/driver.h>
#endif

#if RT_USING_SERIAL_FLASH
#include <spiflash.h>
#include <sf_hal.h>
#endif

#if RT_USING_TCPIP_STACK
#include <enc28j60_io.h>
#include <stm32_eth.h>
#include <telnetd.h>
#include <lwip/private_trap.h>
#endif

#include <rs485.h>
#include <app-thread.h>
#include <tl16_uart.h>
#include <485sw.h>

#define RT_APPS_INIT_DEBUG(x) //rt_kprintf x
#define RT_APPS_INIT_LOG(x)   rt_kprintf x

#define TEST_485	0
#define TEST_TRAP	0
#define TEST_164_LED	0

#define TEST_TL16_485	0
#define PHONY_EM_ECHO	0

#define CREAT_THREAD_FOR_TEST 0

/*
 * 0 -- 不测试
 * 1 -- 逐个输出
 * 2 -- 只报告异常
 * 3 -- 手动
 */
#define TEST_PSRAM_MODE 0


extern void init_tcpip_lwip_stack(void);

extern void nvic_cfg_app(void);
extern int init_syscfgdata_tbl(void);


static rt_uint32_t misc_stack[512/4];
static struct rt_thread misc_thread;


static void rt_sys_misc_entry(void* parameter)
{
	unsigned int cnt=0;
#if 1==TEST_PSRAM_MODE || 2==TEST_PSRAM_MODE /* test PSRAM */
	volatile rt_uint32_t *p = (rt_uint32_t *)STM32_EXT_SRAM_START_ADDR;
	rt_uint32_t i = 0;
#endif

	(void)parameter;

	say_thread_start();

#if EM_MULTI_BASE
#if TEST_164_LED
	serial_to_parallel_bit_vector = 0xa5a5a5a5;
#else
	serial_to_parallel_bit_vector = 0;
	serial_to_parallel_bit_vector_prev = 1;
#endif
#endif
	while (1) {
		cnt++;
		rt_thread_delay(get_ticks_of_ms(250));

#if 1	/* 1Hz blink */
		if (cnt & 0x01) {
			running_led_blink();
			//led_blink(led2_gpio, led2_pin);
#if EM_MULTI_BASE
#if TEST_164_LED
			serial_to_parallel_bit_vector ^= 0xffffffff;
#else
			serial_to_parallel_bit_vector ^= serial_to_parallel_bit_vector_blink;
#endif
			if (serial_to_parallel_bit_vector_prev != serial_to_parallel_bit_vector) {
				write_32bit_to_74hc164(serial_to_parallel_bit_vector);
				serial_to_parallel_bit_vector_prev = serial_to_parallel_bit_vector;
			}
#endif
		}
#endif
#if 0	/* 0.5Hz */
		if (cnt & 0x02) {
		}
#endif
		/* 256s(4.27min) syscfgdata_tbl_cache.syscfg_data */
		if (0!=cnt && (0 == (cnt & 0x3ff))) {
#if RT_USING_FILESYSTEM
			flush_sfwb(0); /* mark by David */
#endif
			syscfgdata_syn_proc();
		}

#if 1==TEST_PSRAM_MODE /* test PSRAM */
	if ((0 == (cnt & 0x7)) && (p < STM32_EXT_SRAM_START_ADDR+STM32_EXT_SRAM_MAX_LEN)) {
		if (0 != i) {
			*p = i++;
			printf_syn("addr:0x%x, value:0x%x\n", p, *p);
		} else {
			rt_uint8_t *pch;
			*p = 0x12345678;
			pch = (rt_uint8_t *)p;
			printf_syn("addr:0x%x, value:0x%x, [0-3]:0x%x, 0x%x, 0x%x, 0x%x\n",
				p, *p, pch[0], pch[1], pch[2], pch[3]);
			++i;
		}
		++p;
	}
#elif 2==TEST_PSRAM_MODE
	if ((0 == (cnt & 0x7)) && (p == STM32_EXT_SRAM_START_ADDR)) {
		for (i=0; i<(STM32_EXT_SRAM_MAX_LEN/4); ++i) {
			*p = i;
			++p;
		}
		printf_syn("write psram over! last addr:0x%x, last value:0x%x, i:0x%x\n", (p-1), *(p-1), i);

		p = (rt_uint32_t *)STM32_EXT_SRAM_START_ADDR;
		//for (i=0; i<(STM32_EXT_SRAM_MAX_LEN/4); ++i) {
		for (i=0; i<3; ++i) {
			if (*p != i) {
				printf_syn("addr:0x%x, value:0x%x, i:0x%x\n", p, *p, i);
			}
			++p;
		}

		p = (rt_uint32_t *)STM32_EXT_SRAM_START_ADDR;
		//for (i=0; i<(STM32_EXT_SRAM_MAX_LEN/4); ++i) {
		for (i=0; i<3; ++i) {
			if (*p != i) {
				printf_syn("addr:0x%x, value:0x%x, i:0x%x\n", p, *p, i);
			}
			++p;
		}

		printf_syn("read psram over!\n");
	}
#endif

#if USE_STM32_IWDG
		/* Reloads IWDG counter with value defined in the reload register */
		/* #define KR_KEY_Reload    ((uint16_t)0xAAAA) */
		IWDG->KR = 0xAAAA;
#endif
	} /* while(1) */

}


#if TEST_485

struct rt_semaphore uart485_1_rx_msg_sem;
struct rt_semaphore uart485_2_rx_msg_sem;
struct rt_semaphore uart485_3_rx_msg_sem;
#if 1
#define WAIT_RX_MSG_TIMEOUT (get_ticks_of_ms(1500))
#else
#define WAIT_RX_MSG_TIMEOUT RT_WAITING_FOREVER
#endif

static rt_err_t uart485_1_rx_ind(rt_device_t dev, rt_size_t size)
{
	rt_sem_release(&uart485_1_rx_msg_sem);

//	rt_kprintf("**%s(), len:%u\n", __FUNCTION__, size);
	return RT_EOK;
}

static rt_err_t uart485_2_rx_ind(rt_device_t dev, rt_size_t size)
{
	rt_sem_release(&uart485_2_rx_msg_sem);

//	rt_kprintf("**%s(), len:%u\n", __FUNCTION__, size);
	return RT_EOK;
}

static rt_err_t uart485_3_rx_ind(rt_device_t dev, rt_size_t size)
{
	rt_sem_release(&uart485_3_rx_msg_sem);

//	rt_kprintf("**%s(), len:%u\n", __FUNCTION__, size);
	return RT_EOK;
}

/*
 * FE FE FE FE 68 AA AA AA AA AA AA 68 01 02 43 C3 D5 16
羽 16:41:57
这个数据帧是什么命令，应该返回什么数据？
张宏磊 16:42:56r
正向有功电能
张宏磊 16:43:12
返回68 43 97 35 14 00 00 68 81 06 43 C3 7B 96 57 33 1B 16
 * */
char cmd_485_seq[] = {0xfe, 0xfe, 0xfe, 0xfe, 0x68, 0xaa, 0xaa, 0xaa, 0xaa, 0xaa, 0xaa, 0x68, 0x01, 0x02, 0x65, 0xf3, 0x27, 0x16};

static void rt_test_485_entry(void* parameter)
{
	rt_device_t dev_485_1;
	rt_device_t dev_485_2;
	rt_device_t dev_485_3;

	rt_size_t read_cnt;

	unsigned char tx_ch = 0;
	unsigned char rx_ch = 0;
	unsigned char rx_buf[4];

	rt_sem_init(&uart485_1_rx_msg_sem, "u485-1", 0, RT_IPC_FLAG_PRIO);
	rt_sem_init(&uart485_2_rx_msg_sem, "u485-2", 0, RT_IPC_FLAG_PRIO);
	rt_sem_init(&uart485_3_rx_msg_sem, "u485-3", 0, RT_IPC_FLAG_PRIO);


	dev_485_1 = rt_device_find(UART_485_1_DEV);
	if (dev_485_1 != RT_NULL && rt_device_open(dev_485_1, RT_DEVICE_OFLAG_RDWR) == RT_EOK) {
		printf_syn("rt_test_485_entry open device:%s succ\n", UART_485_1_DEV);
		rt_device_set_rx_indicate(dev_485_1, uart485_1_rx_ind);
	} else {
		printf_syn("rt_test_485_entry can not find device:%s\n", UART_485_1_DEV);
		return;
	}

	dev_485_2 = rt_device_find(UART_485_2_DEV);
	if (dev_485_2 != RT_NULL && rt_device_open(dev_485_2, RT_DEVICE_OFLAG_RDWR) == RT_EOK) {
		printf_syn("rt_test_485_entry open device:%s succ\n", UART_485_2_DEV);
		rt_device_set_rx_indicate(dev_485_2, uart485_2_rx_ind);
	} else {
		printf_syn("rt_test_485_entry can not find device:%s\n", UART_485_2_DEV);
		return;
	}

	dev_485_3 = rt_device_find(UART_485_3_DEV);
	if (dev_485_3 != RT_NULL && rt_device_open(dev_485_3, RT_DEVICE_OFLAG_RDWR) == RT_EOK) {
		printf_syn("rt_test_485_entry open device:%s succ\n", UART_485_3_DEV);
		rt_device_set_rx_indicate(dev_485_3, uart485_3_rx_ind);
	} else {
		printf_syn("rt_test_485_entry can not find device:%s\n", UART_485_3_DEV);
		return;
	}

	while (1) {
#if 0
		tx_en_rev_disable_485_1();
#else
#if 0
		int rx_cnt, err_cnt;
		rt_err_t err;
		int i;

		rx_cnt = 0;
		err_cnt = 0;

		printf_syn("send cmd: ");
		for (i=0; i<sizeof(cmd_485_seq); ++i)
			printf_syn("%02x ", cmd_485_seq[i]);
		printf_syn("\n");

