donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/application.c
		//rt_enter_critical();
		tx_en_rev_disable_485_2();
		//rt_thread_delay(2);
		dev_485_2->write(dev_485_2, 0, cmd_485_seq, sizeof(cmd_485_seq));
		//rt_thread_delay(1);
		wait_usartx_send_over(USART3);
			
		tx_disable_rev_en_485_2();

		//rt_exit_critical();

		printf_syn("485-2 485 cmd had send over\n");

		while (rx_cnt<23 && err_cnt<2) {
			if (RT_EOK == (err=rt_sem_take(&uart485_2_rx_msg_sem, WAIT_RX_MSG_TIMEOUT))) {
				while (1 == dev_485_2->read(dev_485_2, 0, &rx_ch, 1)) {
					++rx_cnt;
					printf_syn("485-2 recv ind[%3d]:0x%2x\n", rx_cnt, rx_ch);
				}
			} else {
				printf_syn("485-2 recv error(%d)\n", err);
				++err_cnt;
			}
		}

		rt_thread_delay(get_ticks_of_ms(5 * 1000));

#else
		tx_en_rev_disable_485_1();
		rt_thread_delay(2);
		printf_syn("485-1 send:%d\n", tx_ch);
		dev_485_1->write(dev_485_1, 0, &tx_ch, 1);
		rt_thread_delay(2);
		tx_disable_rev_en_485_1();
#if 0
#if 0
		if (RT_EOK == rt_sem_take(&uart485_3_rx_msg_sem, WAIT_RX_MSG_TIMEOUT)) {
			read_cnt = dev_485_3->read(dev_485_3, 0, rx_buf, sizeof(rx_buf));
			if (read_cnt != 0) {
				rx_ch = rx_buf[read_cnt - 1];
			} else {
				rx_ch = 0;
				printf_syn("485-3 recv error(%d)\n", rt_get_errno());
			}

			printf_syn("485-3 recv:%d, read_cnt:%d\n", rx_ch, read_cnt);

			rt_thread_delay(5);

			tx_en_rev_disable_485_3();
			rt_thread_delay(2);
			printf_syn("485-3 send:%d\n", rx_ch);
			dev_485_3->write(dev_485_3, 0, &rx_ch, 1);
			rt_thread_delay(2);
			tx_disable_rev_en_485_3();

		} else {
			printf_syn("485-3 recv error\n");
		}
#else
		if (RT_EOK == rt_sem_take(&uart485_2_rx_msg_sem, WAIT_RX_MSG_TIMEOUT)) {
			read_cnt = dev_485_2->read(dev_485_2, 0, rx_buf, sizeof(rx_buf));
			if (read_cnt != 0) {
				rx_ch = rx_buf[read_cnt - 1];
			} else {
				rx_ch = 0;
				printf_syn("485-2 recv error(%d)\n", rt_get_errno());
			}

			printf_syn("485-2 recv:%d, read_cnt:%d\n", rx_ch, read_cnt);

			rt_thread_delay(5);

			tx_en_rev_disable_485_2();
			rt_thread_delay(2);
			printf_syn("485-2 send:%d\n", rx_ch);
			dev_485_2->write(dev_485_2, 0, &rx_ch, 1);
			rt_thread_delay(2);
			tx_disable_rev_en_485_2();

		} else {
			printf_syn("485-2 recv error\n");
		}

#endif
#else
		if (tx_ch & 0x01) {
			if (RT_EOK == rt_sem_take(&uart485_3_rx_msg_sem, WAIT_RX_MSG_TIMEOUT)) {
				read_cnt = dev_485_3->read(dev_485_3, 0, rx_buf, sizeof(rx_buf));
				if (read_cnt != 0) {
					rx_ch = rx_buf[read_cnt - 1];
				} else {
					rx_ch = 0;
					printf_syn("485-3 recv error(%d)\n", rt_get_errno());
				}

				printf_syn("485-3 recv:%d, read_cnt:%d\n", rx_ch, read_cnt);

				rt_thread_delay(5);

				tx_en_rev_disable_485_3();
				rt_thread_delay(2);
				printf_syn("485-3 send:%d\n", rx_ch);
				dev_485_3->write(dev_485_3, 0, &rx_ch, 1);
				rt_thread_delay(2);
				tx_disable_rev_en_485_3();

			} else {
				printf_syn("485-3 recv error\n");
			}
		} else {
			if (RT_EOK == rt_sem_take(&uart485_2_rx_msg_sem, WAIT_RX_MSG_TIMEOUT)) {
				read_cnt = dev_485_2->read(dev_485_2, 0, rx_buf, sizeof(rx_buf));
				if (read_cnt != 0) {
					rx_ch = rx_buf[read_cnt - 1];
				} else {
					rx_ch = 0;
					printf_syn("485-2 recv error(%d)\n", rt_get_errno());
				}

				printf_syn("485-2 recv:%d, read_cnt:%d\n", rx_ch, read_cnt);

				rt_thread_delay(5);

				tx_en_rev_disable_485_2();
				rt_thread_delay(2);
				printf_syn("485-2 send:%d\n", rx_ch);
				dev_485_2->write(dev_485_2, 0, &rx_ch, 1);
				rt_thread_delay(2);
				tx_disable_rev_en_485_2();

			} else {
				printf_syn("485-2 recv error\n");
			}
		}
#endif
		if (RT_EOK == rt_sem_take(&uart485_1_rx_msg_sem, WAIT_RX_MSG_TIMEOUT)) {
			dev_485_1->read(dev_485_1, 0, &rx_ch, 1);
			printf_syn("485-1 recv echo:%d\n\n", rx_ch);

		} else {
			printf_syn("485-1 recv echo error\n\n");
		}

		rt_thread_delay(get_ticks_of_ms(1*1000));
		++tx_ch;

#endif
#endif
	} /* while(1) */

	return;
}
#endif


#if TEST_TL16_485

#define lt485_log(x) 	printf_syn x

/*
 * FE FE FE FE 68 AA AA AA AA AA AA 68 01 02 43 C3 D5 16
羽 16:41:57
这个数据帧是什么命令，应该返回什么数据？
张宏磊 16:42:56r
正向有功电能
张宏磊 16:43:12
返回68 43 97 35 14 00 00 68 81 06 43 C3 7B 96 57 33 1B 16
 * */
//char cmd_485_seq[] = {0xfe, 0xfe, 0xfe, 0xfe, 0x68, 0xaa, 0xaa, 0xaa, 0xaa, 0xaa, 0xaa, 0x68, 0x01, 0x02, 0x65, 0xf3, 0x27, 0x16};

char tl16_buf[64];

static int read_data_from_tl16(enum lt_485if_e rs485_if, int *had_proc)
{
	rt_device_t dev;
	int recv_data_len, i;

	if (!(rs485_if>=LT_485_TL16_U1 && rs485_if<=LT_485_TL16_U8)) {
		printf_syn("%s() param(%d) error\n", __func__, rs485_if);
		return 0;
	}

	dev = get_us485_dev_ptr(rs485_if, 0);
	recv_data_len = recv_data_by_tl16_485(dev, tl16_buf, sizeof(tl16_buf));

	lt485_log(("%s() read %d bytes from rs485_if-%d\n", __func__,
			recv_data_len, rs485_if));

	for (i=0; i<recv_data_len; ++i) {
		printf_syn("lt_if-%d:0x%02x\n", rs485_if, tl16_buf[i]);
		++*had_proc;
	}

	return recv_data_len;
}

static void rt_test_tl16_485_entry(void* parameter)
{
	rt_uint32_t e;
	rt_err_t err;
	int had_proc;

	while (1) {
		err = rt_event_recv(&em_protocol_data_event_set,
				EVENT_BIT_TL16_1_RECV_DATA | EVENT_BIT_TL16_2_RECV_DATA
				| EVENT_BIT_TL16_3_RECV_DATA | EVENT_BIT_TL16_4_RECV_DATA
				| EVENT_BIT_TL16_5_RECV_DATA | EVENT_BIT_TL16_6_RECV_DATA
				| EVENT_BIT_TL16_7_RECV_DATA | EVENT_BIT_TL16_8_RECV_DATA,
				RT_EVENT_FLAG_OR | RT_EVENT_FLAG_CLEAR, RT_WAITING_FOREVER, &e);

		if (RT_EOK != err) {
			lt485_log(("%s(), recv event error(%d)\n", __func__, err));
			continue;
		}

		lt485_log(("%s() recv event 0x%x\n", __func__, e));

		do {
			had_proc = 0;

			if (is_bit_set(e, EVENT_BIT_TL16_1_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U1, &had_proc);

			if (is_bit_set(e, EVENT_BIT_TL16_2_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U2, &had_proc);

			if (is_bit_set(e, EVENT_BIT_TL16_3_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U3, &had_proc);

			if (is_bit_set(e, EVENT_BIT_TL16_4_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U4, &had_proc);

