donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/application.c
			if (is_bit_set(e, EVENT_BIT_TL16_5_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U5, &had_proc);

			if (is_bit_set(e, EVENT_BIT_TL16_6_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U6, &had_proc);

			if (is_bit_set(e, EVENT_BIT_TL16_7_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U7, &had_proc);

			if (is_bit_set(e, EVENT_BIT_TL16_8_RECV_DATA))
				read_data_from_tl16(LT_485_TL16_U8, &had_proc);
		} while (had_proc);
	} /* while(1) */

	return;
}

static void rt_test_tl16_485_use_emc_if_entry(void* parameter)
{
	void *ptr;
	int send_data_len, i;
	unsigned char buf[] = {
			0xfe, 0xfe, 0xfe, 0xfe, 0x68,
			0x47, 0x54, 0x00, 0x12, 0x00,
			0x00, 0x68, 0x01, 0x02, 0x65,
			0xf3, 0xd8, 0x16};

	ptr = get_us485_dev_ptr(LT_485_EMC_UART, 1);

	while (1) {
		printf_syn("\n%s() will send frame:\n", __func__);
		for (i=0; i<sizeof(buf); ++i)
			printf_syn("0x%02x ", buf[i]);

		printf_syn("\n\n");

		send_data_len = send_data_by_485(ptr, buf, sizeof(buf));

		if (sizeof(buf) != send_data_len) {
			printf_syn("%s() send_data_len is err(%d/%d)\n", __func__,
					send_data_len, sizeof(buf));
		}

		rt_thread_delay(get_ticks_of_ms(5*1000));

	} /* while(1) */

	return;
}

#endif /* TEST_TL16_485 */

#if PHONY_EM_ECHO
#define lt485_log(x) 	printf_syn x

static void rt_test_phony_em_echo_entry(void* parameter)
{
	void *ptr;
	rt_err_t err;
	rt_uint32_t e;
	int send_data_len, recv_data_len, i;
	unsigned char buf[128];

	ptr = get_us485_dev_ptr(LT_485_EMC_UART, 1);

	while (1) {
		err = rt_event_recv(&em_protocol_data_event_set, EVENT_BIT_UART485_2_RECV_DATA,
				RT_EVENT_FLAG_OR | RT_EVENT_FLAG_CLEAR, RT_WAITING_FOREVER, &e);

		lt485_log(("%s() recv event 0x%x\n", __func__, e));

		rt_thread_delay(get_ticks_of_ms(250));

		if (RT_EOK == err) {
			do {
				recv_data_len = recv_data_by_485(ptr, buf, sizeof(buf));

				if (!recv_data_len)
					break;

				printf_syn("\n%s() will send echo %d byte(s):\n", __func__, recv_data_len);
				for (i=0; i<recv_data_len; ++i)
					printf_syn("0x%02x ", buf[i]);
				printf_syn("\n\n");

				send_data_len = send_data_by_485(ptr, buf, recv_data_len);

				if (recv_data_len != send_data_len) {
					printf_syn("%s() send_data_len is err(%d/%d)\n", __func__,
							send_data_len, recv_data_len);
				}
			}while (recv_data_len);

		} else {
			printf_syn("%s() recv event fail(%d)\n", __func__, err);
		}

	} /* while(1) */


	return;
}
#endif /* PHONY_EM_ECHO */

void rt_init_thread_entry(void* parameter)
{
#if RT_USING_RTC
	rt_device_t rtc_dev;
#endif
#if TEST_TRAP || EM_ALL_TYPE_BASE || TEST_485 || TEST_TL16_485 || PHONY_EM_ECHO
	rt_thread_t thread_h;
#endif
	RT_APPS_INIT_DEBUG(("invoke rt_init_thread_entry()!\n"));

	say_thread_start();

#if TEST_485
	thread_h = rt_thread_create("t485", rt_test_485_entry, RT_NULL, 512, 30, 10);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);
#endif
#if TEST_TRAP
		trap_test_init();
#endif

#if EM_ALL_TYPE_BASE && !TEST_485
	/* recv ptct info server */
	thread_h = rt_thread_create("rpct-ser", recv_em_frame, RT_NULL, 1024, 30, 10);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);
#endif

	/* Filesystem Initialization */
#if RT_USING_FILESYSTEM
	RT_APPS_INIT_DEBUG(("will init fs\n"));
	rt_hw_spiflash_init();
	sf_set_prote_level_to_none();

	/* init the device filesystem */
	dfs_init();
#ifdef RT_USING_DFS_ELMFAT
	/* init the elm chan FatFs filesystam*/
	elm_init();

#if 1
	/* mount spi-flash fat partition 1 as root directory */
	if (dfs_mount("sf0", "/", "elm", 0, 0) == 0)
#else
	/* mount sd card fat partition 1 as root directory */
	if (dfs_mount("sd0", "/", "elm", 0, 0) == 0)
#endif
		rt_kprintf("File System initialized!\n");
	else
		rt_kprintf("File System initialzation failed!\n");
#endif

#endif

	/* LwIP Initialization */
#if RT_USING_TCPIP_STACK
	init_tcpip_lwip_stack();
#endif

#if RT_USING_GUI
	{
		extern void rtgui_startup();
		extern void rt_hw_lcd_init();
		extern void rtgui_touch_hw_init(void);

		rt_device_t lcd;

		/* init lcd */
		rt_hw_lcd_init();

		/* init touch panel */
		rtgui_touch_hw_init();

		/* re-init device driver */
		rt_device_init_all();

		/* find lcd device */
		lcd = rt_device_find("lcd");

		/* set lcd device as rtgui graphic driver */
		rtgui_graphic_set_device(lcd);

		/* startup rtgui */
		rtgui_startup();
	}
#endif /* #if RT_USING_GUI */


#if USE_STM32_IWDG
	IWDG_Enable();
#endif

#if RT_USING_RTC
	rtc_dev = rt_device_find("rtc");
	if (NULL != rtc_dev) {
		rtc_dev->control(rtc_dev, RT_DEVICE_CTRL_RTC_CALI_SET, NULL);
	} else {
		rt_kprintf("find rtc device fail\n");
	}
#endif

	rt_thread_delay(2);
	tl16c554_1_reset_deact();
	tl16c554_2_reset_deact();
	rt_kprintf("tl16c554 reset over\n");
	rt_hw_tl16_usart_init();

#if (RT_USING_RS485_BUS && !TEST_485 && !CREAT_THREAD_FOR_TEST)
	init_sys_485();
#endif

#if 1 && !TEST_TL16_485 && !PHONY_EM_ECHO && !CREAT_THREAD_FOR_TEST	/* mark by David */
	extern void lt_485sw_init(void);
	lt_485sw_init();
#endif

#if 0
	rt_485sw_em_init();
	uart_485_tl16_1_dev_init();
	uart_485_tl16_2_dev_init();
	uart_485_tl16_3_dev_init();
	uart_485_tl16_4_dev_init();
	uart_485_tl16_5_dev_init();
	uart_485_tl16_6_dev_init();
	uart_485_tl16_7_dev_init();
	uart_485_tl16_8_dev_init();
#endif

#if TEST_TL16_485
	thread_h = rt_thread_create("tl16-485", rt_test_tl16_485_entry, RT_NULL, 512, 30, 50);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);

	thread_h = rt_thread_create("emc-p485", rt_test_tl16_485_use_emc_if_entry, RT_NULL, 512, 30, 50);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);

#endif

#if PHONY_EM_ECHO
	thread_h = rt_thread_create("phony-em", rt_test_phony_em_echo_entry, RT_NULL, 512+512, 30, 50);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);
#endif

	nvic_cfg_app();
}

#if !CREAT_THREAD_FOR_TEST
extern int do_tl16_irq(enum tl16_x_csx_addr_e x_csx, int *had_proc);

