donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/application.c
static void rt_isr_event_entry(void* parameter)
{
	rt_err_t err;
	rt_uint32_t e;
	enum tl16_x_csx_addr_e x_csx;
	int had_proc;
	rt_tick_t temp_tick;

	printf_syn("rt_isr_event_entry()\n");
	say_thread_start();

	while (1) {
		err = rt_event_recv(&isr_event_set
				, EVENT_BIT_NEED_RUN_TL16_1_IRQ | EVENT_BIT_NEED_RUN_TL16_2_IRQ
				, RT_EVENT_FLAG_OR | RT_EVENT_FLAG_CLEAR, RT_WAITING_FOREVER, &e);

		if (RT_EOK != err) {
			printf_syn("recv isr event error(%d)", err);
		} else {
			temp_tick = rt_tick_get();
			do {
				had_proc = 0;
				if (is_bit_set(e, EVENT_BIT_NEED_RUN_TL16_1_IRQ)) {
					err = rt_mutex_take(&tl16_x_lock, RT_WAITING_FOREVER);
					if (RT_EOK == err) {
						for (x_csx=TL16_1_CSA_ADDR; x_csx<=TL16_1_CSD_ADDR; ++x_csx) {
							do_tl16_irq(x_csx, &had_proc);
						}
						rt_mutex_release(&tl16_x_lock);
					} else {
						printf_syn("%s(), get tl16_x_lock fail(%d)\n", __func__, err);
					}

				}

				if (is_bit_set(e, EVENT_BIT_NEED_RUN_TL16_2_IRQ)) {
					err = rt_mutex_take(&tl16_x_lock, RT_WAITING_FOREVER);
					if (RT_EOK == err) {
						for (x_csx=TL16_2_CSA_ADDR; x_csx<=TL16_2_CSD_ADDR; ++x_csx) {
							do_tl16_irq(x_csx, &had_proc);
						}
						rt_mutex_release(&tl16_x_lock);
					} else {
						printf_syn("%s(), get tl16_x_lock fail(%d)\n", __func__, err);
					}
				}
			} while ((had_proc || pin_in_is_set(tl16c554_1_intx_gpio, tl16c554_1_intx_pin)
					|| pin_in_is_set(tl16c554_2_intx_gpio, tl16c554_2_intx_pin))
					&& (rt_tick_get() - temp_tick < get_ticks_of_ms(1000)));
		}
	}

	return;
}
#endif

#if CREAT_THREAD_FOR_TEST
static struct rt_mutex test_mutex;

static void rt_tst_1_entry(void* parameter)
{
	rt_err_t err;


	while (1) {
		rt_thread_delay(get_ticks_of_ms(3000));

		err = rt_mutex_take(&test_mutex, get_ticks_of_ms(2000));
		if (RT_EOK != err) {
			printf_syn("%s() get mutex fail(%d)\n", __func__, err);
		} else {
			if (rt_thread_self() != test_mutex.owner) {
				printf_syn("PANIC:%d, %s(), self:%s(%d,%d,%d), owner:%s(%d, %d, %d), %d, %d, %d\n",
						 __LINE__, __func__, rt_thread_self()->name,
						 rt_thread_self()->init_priority,
						 rt_thread_self()->current_priority,
						 rt_thread_self()->error,
						test_mutex.owner->name,
						test_mutex.owner->init_priority,
						test_mutex.owner->current_priority,
						test_mutex.owner->error,
						test_mutex.hold, test_mutex.original_priority,
						test_mutex.value);
			}

			printf_syn("=============================%s(), line:%d, had get mutex, will release...\n", __func__, __LINE__);
			rt_thread_delay(get_ticks_of_ms(500));

			err = rt_mutex_release(&test_mutex);
			if (RT_EOK != err) {
				printf_syn("th:%s, line:%d, %s() release mutex fail(%d), owner:%s\n",
						rt_thread_self()->name, __LINE__, __func__, err,
						test_mutex.owner->name);
			}
		}
	}

}

static void rt_tst_2_entry(void* parameter)
{
	rt_err_t err;


	while (1) {
		rt_thread_delay(get_ticks_of_ms(2900));

		err = rt_mutex_take(&test_mutex, get_ticks_of_ms(2000));
		if (RT_EOK != err) {
			printf_syn("%s() get mutex fail(%d)\n", __func__, err);
		} else {
			if (rt_thread_self() != test_mutex.owner) {
				printf_syn("PANIC:%d, %s(), self:%s(%d,%d,%d), owner:%s(%d, %d, %d), %d, %d, %d\n",
						 __LINE__, __func__, rt_thread_self()->name,
						 rt_thread_self()->init_priority,
						 rt_thread_self()->current_priority,
						 rt_thread_self()->error,
						test_mutex.owner->name,
						test_mutex.owner->init_priority,
						test_mutex.owner->current_priority,
						test_mutex.owner->error,
						test_mutex.hold, test_mutex.original_priority,
						test_mutex.value);
			}

			printf_syn("=============================%s(), line:%d, had get mutex, will release...\n", __func__, __LINE__);
			rt_thread_delay(get_ticks_of_ms(500));

			err = rt_mutex_release(&test_mutex);
			if (RT_EOK != err) {
				printf_syn("th:%s, line:%d, %s() release mutex fail(%d), owner:%s\n",
						rt_thread_self()->name, __LINE__, __func__, err,
						test_mutex.owner->name);
			}
		}
	}

	return;
}
#endif

extern struct rt_mutex print_mutex;

#if RT_USING_FILESYSTEM
extern struct rt_semaphore spiflash_sem;
#endif
int rt_application_init()
{
	rt_thread_t thread_h;
	rt_err_t result;

	/* init system data cfg table */
	init_syscfgdata_tbl();

	rt_mutex_init(&print_mutex, "prtmux", RT_IPC_FLAG_PRIO);
#if RT_USING_FILESYSTEM
	rt_sem_init(&spiflash_sem, "sfsem", 1, RT_IPC_FLAG_PRIO);
#endif
	rt_mutex_init(&tl16_x_lock, "tl16-x", RT_IPC_FLAG_PRIO);
	rt_event_init(& isr_event_set, "isr_eve", RT_IPC_FLAG_PRIO);


	RT_APPS_INIT_DEBUG(("func:%s(), will init rt_sys_misc_entry\n", __FUNCTION__));
	/* init led thread */
	result = rt_thread_init(&misc_thread, "misc", rt_sys_misc_entry, RT_NULL, (rt_uint8_t*)&misc_stack[0],
							sizeof(misc_stack), 0x19, 5);
	if (result == RT_EOK)
		rt_thread_startup(&misc_thread);

#if !CREAT_THREAD_FOR_TEST
	thread_h = rt_thread_create("isr_e", rt_isr_event_entry, RT_NULL, 1024, ISR_EVENT_THREAD_PRIORITY, 10);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);
#endif

#if (RT_THREAD_PRIORITY_MAX == 32)
	thread_h = rt_thread_create("init", rt_init_thread_entry, RT_NULL, 2048, 8, 20);
#else
	thread_h = rt_thread_create("init", rt_init_thread_entry, RT_NULL, 2048, 80, 20);
#endif
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);

	RT_APPS_INIT_DEBUG(("func:%s(), base thread initial over\n", __FUNCTION__));

#if CREAT_THREAD_FOR_TEST
	rt_mutex_init(&test_mutex, "tst", RT_IPC_FLAG_PRIO);

	thread_h = rt_thread_create("tst-1", rt_tst_1_entry, RT_NULL, 1024, 11, 10);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);

	thread_h = rt_thread_create("tst-2", rt_tst_2_entry, RT_NULL, 1024, 12, 10);
	if (thread_h != RT_NULL)
		rt_thread_startup(thread_h);
#endif
	return 0;
}



#if 1
int sys_info(void)
{
	rt_tick_t rtc_secs;
	int days, hours, mins, seconds;
#if RT_USING_RTC
	extern volatile unsigned long rtc_1s_int_cnt;
	rtc_secs = rtc_1s_int_cnt;
#else
	rtc_secs = rt_tick_get() / RT_TICK_PER_SECOND;
#endif
	days  = rtc_secs / (24*3600);

	rtc_secs %= 24*3600;
	hours = rtc_secs / 3600;

	rtc_secs %= 3600;
	mins  = rtc_secs / 60;

	seconds  = rtc_secs % 60;

	printf_syn("system had run time is %d days %d:%d:%d(H:M:S)\n", days, hours, mins, seconds);

	return 0;
}
FINSH_FUNCTION_EXPORT(sys_info, print sys info);
#endif


#if RT_USING_TCPIP_STACK
void init_tcpip_lwip_stack(void)
{
	extern void lwip_system_init(void);
	extern rt_err_t eth_system_device_init(void);

	/* register ethernetif device */
	eth_system_device_init();
	RT_APPS_INIT_DEBUG(("eth_system_device_init() succ!\n"));

	rt_hw_stm32_eth_init();
	RT_APPS_INIT_DEBUG(("func:%s, line:%u, eie:0x%x!\n", __FUNCTION__, __LINE__, enc28j60_read(EIE)));
	/* to assure Ethernet Phy work well */ //lihao
	//Ethernet_Security();
	RT_APPS_INIT_DEBUG(("func:%s, line:%u!\n", __FUNCTION__, __LINE__));

	/* re-init device driver */
	rt_device_init_all();
	RT_APPS_INIT_DEBUG(("func:%s, line:%u, eie:0x%x!\n", __FUNCTION__, __LINE__, enc28j60_read(EIE)));

	/* init lwip system */
	lwip_system_init();
	RT_APPS_INIT_LOG(("TCP/IP initialized, eie:0x%x!\n", enc28j60_read(EIE)));

	/* init net apps */
#if RT_USING_HTTPSERVER_RAW
	httpd_init();
#endif

#if RT_USING_TELNETD
	telnetd_init();
#endif
}
#endif




/*@}*/
